app/Controllers/Dashboard.php

function getCheckinCount($db, $startDate, $endDate)
{
    // Convert to full datetime range
    $startDateTime = $startDate . ' 00:00:00';
    $endDateTime   = $endDate . ' 23:59:59';

    // -------- SD TABLE COUNT --------
    $sdCount = $db->table('security_gate_logs')
        ->where('check_in_time >=', $startDateTime)
        ->where('check_in_time <=', $endDateTime)
        ->countAllResults();

    // -------- MD TABLE COUNT --------
    $mdCount = $db->table('security_gate_logs_md')
        ->where('check_in_time >=', $startDateTime)
        ->where('check_in_time <=', $endDateTime)
        ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `security_gate_logs`
WHERE `check_in_time` >= '2026-03-03 00:00:00'
AND `check_in_time` <= '2026-03-03 23:59:59'
SELECT COUNT(*) AS `numrows`
FROM `security_gate_logs_md`
WHERE `check_in_time` >= '2026-03-03 00:00:00'
AND `check_in_time` <= '2026-03-03 23:59:59'

            $companyModel = new CompanyModel();
            $departmentModel = new DepartmentModel();

            $data['companies'] = $companyModel
                ->orderBy('company_name', 'ASC')
                ->findAll();

            $data['departments'] = $departmentModel
                ->orderBy('department_name', 'ASC')
                ->findAll();
---
SELECT *
FROM `companies`
ORDER BY `company_name` ASC
SELECT *
FROM `departments`
ORDER BY `department_name` ASC