app/Controllers/NotificationController.php

public function getUnread()
{
    $session = session();
    $userId = $session->get('user_id');

    $model = new \App\Models\NotificationUserModel();

    $notifications = $model->select('notifications.*')
        ->join('notifications', 'notifications.id = notification_users.notification_id')
        ->where('notification_users.user_id', $userId)
        ->where('notification_users.is_read', 0)
        ->where('notifications.status', 1)
        ->orderBy('notifications.created_at', 'DESC')
        ->findAll();
---
SELECT `notifications`.*
FROM `notification_users`
JOIN `notifications` ON `notifications`.`id` = `notification_users`.`notification_id`
WHERE `notification_users`.`user_id` = '1'
AND `notification_users`.`is_read` = 0
AND `notifications`.`status` = 1
ORDER BY `notifications`.`created_at` DESC