app/Controllers/ReportController.php

            $deptBuilder = $db->table('visitor_request_header');
            //  Load Departments dynamically
            $departmentModel = new DepartmentModel();
            $data['departments'] = $departmentModel
                ->orderBy('department_name', 'ASC')
                ->findAll();

            $companyModel = new CompanyModel();
            $data['companies'] = $companyModel->orderBy('company_name', 'ASC')->findAll();
---
SELECT *
FROM `departments`
ORDER BY `department_name` ASC
SELECT *
FROM `companies`
ORDER BY `company_name` ASC