app/Controllers/SecurityController.php

SELECT *
FROM `departments`
SELECT *
FROM `companies`
---
     public function View_authorized_visitor_list()
    {
          $deptModel = new DepartmentModel();
          $companyModel = new CompanyModel();
          $data['departments'] = $deptModel->findAll();
           $data['companies'] = $companyModel->findAll();

SELECT *
FROM `visitors`
WHERE `v_code` = 'V000018'
 LIMIT 1
---
    public function securityAction()
    {
        date_default_timezone_set('Asia/Kolkata');

        $logModel     = new \App\Models\SecurityGateLogModel();
        $visitorModel = new \App\Models\VisitorRequestModel();
        $v_code = $this->request->getPost('v_code');

        // 🔹 Validate V-Code
        $visitor = $visitorModel->where('v_code', $v_code)->first();