app/Controllers/User.php

SELECT *
FROM `departments`
SELECT *
FROM `roles`
SELECT *
FROM `companies`
---

        // Fetch data
        $data['users']       = $userModel->findAll();
        $data['departments'] = $deptModel->findAll();
        $data['roles']       = $roleModel->findAll();
        $data['companies']   = $companyModel->findAll();