app/Controllers/VisitorRequest.php

    public function groupVisitorRequestForm(): string
    {
        $session = session();
        $dep_id     = $session->get('dep_id');
        $role_id    = $session->get('role_id');
        $user_id    = $session->get('user_id');
        $company    = $session->get('company_name');

        $userModel = new \App\Models\UserModel();
        if ($role_id == 1) {
            $admins = $userModel
                        ->where('role_id', 2)
                        ->orderBy('priority', 'ASC')
                        ->findAll();
        }
        elseif ($role_id == 2) {
            $admins = $userModel
                        ->where('id', $user_id)
                        ->orderBy('priority', 'ASC')
                        ->findAll();
---
SELECT *
FROM `users`
WHERE `role_id` = 2
ORDER BY `priority` ASC

        ];

        $purposeModel = new PurposeModel();
        $data['purposes'] = $purposeModel
            ->where('status', 1)
            ->orderBy('purpose_name', 'ASC')
            ->findAll();
---
SELECT *
FROM `purposes`
WHERE `status` = 1
ORDER BY `purpose_name` ASC

            ->get()
            ->getResultArray();

        $data['vendorTypes'] = $db->table('category_master')
            ->where('status', 1)
            ->where('purpose', 'Vendor')
            ->orderBy('category_name', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `category_master`
WHERE `status` = 1
AND `purpose` = 'Recce'
ORDER BY `category_name` ASC

    public function visitorData()
    {
            $role = session()->get('role_id');
            $uid  = session()->get('user_id');

            $query = $this->VisitorRequestHeaderModel
                      ->orderBy('id', 'DESC')
                      ->limit(200);
---
SELECT *
FROM `visitor_request_header`
ORDER BY `id` DESC
 LIMIT 200

    public function getVisitorRequastDataByVCode()
    {
        $v_code = $this->request->getPost('v_code');

        $headerModel = new \App\Models\VisitorRequestHeaderModel();
        $securityGateLogMD = new \App\Models\SecurityGateLogMDModel();

        $data = $headerModel->getHeaderWithVisitorsMailDataByVCode($v_code);

        // $securityGateLogMDData = $securityGateLogMD->where('v_code', $v_code)->findAll();

        // $securityGateLogMDData = $securityGateLogMD
        // ->where('v_code', $v_code)
        // ->orderBy('id', 'DESC')
        // ->findAll();

        $db = \Config\Database::connect();

        $securityGateLogMDData = $db->table('security_gate_logs_md md')
        ->select("
            md.*,
            u1.name AS verified_by_name,
            u2.name AS updated_by_name
            ")
            ->join('users u1', 'u1.id = md.verified_by', 'left')
            ->join('users u2', 'u2.id = md.updated_by', 'left')
            ->where('md.v_code', $v_code)
            ->orderBy('md.id', 'DESC')
            ->get()
        ->getResultArray();
---
SELECT `md`.*, `u1`.`name` AS `verified_by_name`, `u2`.`name` AS `updated_by_name`
FROM `security_gate_logs_md` `md`
LEFT JOIN `users` `u1` ON `u1`.`id` = `md`.`verified_by`
LEFT JOIN `users` `u2` ON `u2`.`id` = `md`.`updated_by`
WHERE `md`.`v_code` = 'V00000284'
ORDER BY `md`.`id` DESC


            $db = \Config\Database::connect();

            $expiredMDVisitors = $db->table('visitors vr')
                ->select('vr.*')
                ->where('vr.validity', 1)
                ->where('vr.validity_type', 'MD')
                ->where('vr.valid_to <', $today)
                ->where("NOT EXISTS (
                    SELECT 1
                    FROM security_gate_logs_md md
                    WHERE md.v_code = vr.v_code
                )", null, false)   // IMPORTANT: false prevents escaping
                ->get()
                ->getResultArray();
---
SELECT `vr`.*
FROM `visitors` `vr`
WHERE `vr`.`validity` = 1
AND `vr`.`validity_type` = 'MD'
AND `vr`.`valid_to` < '2026-02-28'
AND NOT EXISTS (
                    SELECT 1 
                    FROM security_gate_logs_md md 
                    WHERE md.v_code = vr.v_code
                )

public function autoExitMDVisitors()
{
    $db = \Config\Database::connect();

    /*
    ----------------------------------------------------
    Update records where:
    - Entry exists
    - Exit not done
    - Entry date is before today (day completed)
    ----------------------------------------------------
    */

    $db->table('security_gate_logs_md')
        ->where('check_in_time IS NOT NULL', null, false)
        ->where('check_out_time IS NULL', null, false)
        ->where('DATE(check_in_time) <', date('Y-m-d')) // Only past days
        ->set('check_out_time', "CONCAT(DATE(check_in_time), ' 23:59:59')", false)
        ->set('updated_by', 0)
        ->set('updated_at', date('Y-m-d H:i:s'))
        ->update();
---
UPDATE `security_gate_logs_md` SET `check_out_time` = CONCAT(DATE(check_in_time), ' 23:59:59'), `updated_by` = 0, `updated_at` = '2026-02-28 17:06:35'
WHERE check_in_time IS NOT NULL
AND check_out_time IS NULL
AND DATE(check_in_time) < '2026-02-28'