app/Models/FeedbackModel.php

        }


        return $builder
                ->orderBy('feedback.feedback_id', 'DESC')
                ->findAll();
---
SELECT `feedback`.*, `u`.`name` as `user_name`, `u`.`email` as `user_email`, `d`.`department_name`, `u`.`company_name`
FROM `feedback`
LEFT JOIN `users` `u` ON `u`.`id` = `feedback`.`create_by`
LEFT JOIN `departments` `d` ON `d`.`id` = `u`.`department_id`
ORDER BY `feedback`.`feedback_id` DESC