app/Models/SecurityGateLogModel.php

    public function getRecentAuthorizedForSecurityList($limit = 50)
    {
        return $this->select("
                security_gate_logs.*,
                visitors.visitor_name,
                visitors.visitor_phone,
                visitors.purpose,
                visitors.v_code,
                visitor_request_header.department AS department_name,
                users.name AS created_by_name
            ")
            ->join('visitors', 'visitors.id = security_gate_logs.visitor_request_id', 'left')
            ->join('visitor_request_header', 'visitor_request_header.id = visitors.request_header_id', 'left')
            ->join('users', 'users.id = visitors.created_by', 'left')
            ->where('visitors.status', 'approved')
            ->orderBy('security_gate_logs.check_in_time', 'DESC')
            ->limit($limit)
            ->find();
---
SELECT `security_gate_logs`.*, `visitors`.`visitor_name`, `visitors`.`visitor_phone`, `visitors`.`purpose`, `visitors`.`v_code`, `usersdata`.`name` as `created_by_name`, `referred_user`.`name` as `referred_name`
FROM `security_gate_logs`
LEFT JOIN `visitors` ON `visitors`.`id` = `security_gate_logs`.`visitor_request_id`
LEFT JOIN `visitor_request_header` ON `visitor_request_header`.`id` = `visitors`.`request_header_id`
LEFT JOIN `users` as `usersdata` ON `usersdata`.`id` = `visitors`.`created_by`
LEFT JOIN `users` AS `referred_user` ON `referred_user`.`id` = `visitor_request_header`.`referred_by`
WHERE `visitors`.`status` = 'approved'
ORDER BY `security_gate_logs`.`check_in_time` DESC
 LIMIT 10