app/Models/VisitorRequestHeaderModel.php

public function getHeaderWithVisitorsMailDataByVCode($vCode)
{
    return $this->select([
            'visitor_request_header.*',
            'visitors.id as v_id',
            'visitors.visitor_name',
            'visitors.visitor_email',
            'visitors.meeting_status',
            'visitors.visitor_phone',
            'visitors.proof_id_type',
            'visitors.proof_id_number',
            'visitors.v_code',
            'visitors.qr_code',
            'visitors.vehicle_no',
            'visitors.visit_date',
            'visitors.visit_time',
            'visitors.vehicle_type',
            'visitors.v_phopto_path',
            'visitors.securityCheckStatus',
            'users.name as created_by_name',
            'users.email as created_by_email',
            'refUser.name as referred_by_name',
            'departments.department_name'
        ])
        ->join('visitors', 'visitors.request_header_id = visitor_request_header.id', 'left')
        ->join('users', 'users.id = visitors.created_by', 'left')
        ->join('users AS refUser', 'refUser.id = visitor_request_header.referred_by', 'left')
        ->join('departments', 'departments.id = users.department_id', 'left')
        ->where('visitors.v_code', $vCode)
        ->findAll();
---
SELECT `visitor_request_header`.*, `visitors`.`id` as `v_id`, `visitors`.`visitor_name`, `visitors`.`visitor_email`, `visitors`.`meeting_status`, `visitors`.`visitor_phone`, `visitors`.`proof_id_type`, `visitors`.`proof_id_number`, `visitors`.`v_code`, `visitors`.`qr_code`, `visitors`.`vehicle_no`, `visitors`.`visit_date`, `visitors`.`visit_time`, `visitors`.`valid_from`, `visitors`.`valid_to`, `visitors`.`validity_type`, `visitors`.`vehicle_type`, `visitors`.`v_phopto_path`, `visitors`.`securityCheckStatus`, `users`.`name` as `created_by_name`, `users`.`email` as `created_by_email`, `refUser`.`name` as `referred_by_name`, `departments`.`department_name`, `security_gate_logs`.`check_in_time` as `check_in`, `security_gate_logs`.`check_out_time` as `check_out`, `u3`.`name` as `check_in_by`, `u4`.`name` as `check_out_by`
FROM `visitor_request_header`
LEFT JOIN `visitors` ON `visitors`.`request_header_id` = `visitor_request_header`.`id`
LEFT JOIN `users` ON `users`.`id` = `visitors`.`created_by`
LEFT JOIN `users` AS `refUser` ON `refUser`.`id` = `visitor_request_header`.`referred_by`
LEFT JOIN `departments` ON `departments`.`id` = `users`.`department_id`
LEFT JOIN `security_gate_logs` ON `security_gate_logs`.`visitor_request_id` = `visitors`.`id`
LEFT JOIN `users` `u3` ON `u3`.`id` = `security_gate_logs`.`verified_by`
LEFT JOIN `users` `u4` ON `u4`.`id` = `security_gate_logs`.`updated_by`
WHERE `visitors`.`v_code` = 'V00000284'